# -*- coding: utf-8 -*-

# dictionary contains cells' description
textinfo = {
    u"1br" : u"Одна бутылочка рома, который прибавляет сил, сноровки, сообразительности и еще чего-нибудь настоящему джентельмену удачи йо-хо-хо! <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"2br" : u"Две звонких бутылочки превосходного рома, который прибавляет сил, сноровки, сообразительности и еще чего-нибудь настоящему джентельмену удачи йо-хо-хо!<br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"3br" : u"Три(!) замечательных бутылочки наивкуснейшего рома, который прибавляет сил, сноровки, сообразительности и еще чего-нибудь настоящему джентельмену удачи йо-хо-хо! <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    
    u"1сс" : u"Одна деньга, она отражается в единственном зрачке пирата (кому повезло, у того в двух) <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"2сс" : u"Две монетки. Можно унести, а можно и на месте оставить <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"3сс" : u"Три тяжеленьких монетки. Неси по одной, не ошибешься <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"4сс" : u"Целых четыре монеты, таких приятных на ощупь. Желанная добыча! <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"5сс" : u"Пять! Пять! Пять монет за раз!!!. Жаль, такой клад был зарыт лишь один раз <br> <i>Предмет(ы) необходимо немедленно положить на поле<\i>",
    u"3gn" : u"ЙО-ХО-ХО!!!. Вот это удача! Сокровище испанского галлеона <br> <i>По стоимости оно приравнивается к трем обычным монетам, но сундук можно утащить сразу <br> Предмет(ы) необходимо немедленно положить на поле<\i>",
    
    u"2mc" : u"Ох уж эти джунгли! Придется потратить еще ход",
    u"3mc" : u"Проклятая пустыня! Два хода еще тут топтаться!",
    u"4mc" : u"Вот жизнь пиратская, в болота забросила. С ромом пират мог бы проскочить эту клетку за один ход, но где же его взять?!",
    u"5mc" : u"Да! Это определенно хуже пустынь, джунглей и болот. На такой скале любой пират позавидует Пятнице, Пятница, в свою очередь, туристу, но все-таки пройдет(Пятница) такую клетку разом",

    u"bgn" : u"О! Да это же Бен Ган! Он поделится своим обедом и конечно же поможет отыскать эти звонкие кругляшки<br><i>Поставьте фишку Бена Гана на клетку. Он будет под командованием того игрока, который нашел его первым</i>",
    u"frd" : u"Лачуга местного аборигена.. Пятница, добрый малый, оказался не прочь побегать по острову<br><i>Поставьте фишку Пятницы на клетку. Он будет под командованием того игрока, который нашел его первым, если его не пераманят</i>",
    u"pst" : u"Старый проповедник будет учить доброй жизни, но только пока он трезв<br><i>Поставьте фишку Священника на клетку. Он будет под командованием того игрока, который нашел его первым</i>",
    
    u"em1" : u"Полянка. Можно посидеть на бревнышке, полежать на травке, погреться на солнышке. Маймотес-шмотес просушить",
    u"crb" : u"Необходимо немедленно выругаться по-пиратски!<br>Можно пару раз",
    u"crd" : u"Крокодильчик, из такого можно на всю команду сапогов пошить, да скорее уж наоборот выйдет <br><i>Отступите назад</i>",
    u"drg" : u"Конопляные поля. Пираты начинают вытворять странные вещи: прыгать в капканы, засовывать голову в дуло пушки, объснять людоеду, где тот неправ",
    u"erq" : u"Землетрясение!<br><i>Скорее поменяйте две клетки местами, на которых ничего не лежит и никто не стоит</i>",
    u"erq" : u"Счастье привалило! Огромная бочка рома. Она огромна настолько, что ее нельзя унести. Но, кажется, из нее торчит краник<br><i>Этот пират пропускает ход</i>",
    
}